&НаСервереБезКонтекста
Функция ТоварыТоварПриИзмененииНаСервере(Товар)
	Возврат Товар.ЦенаПоступления*1.25;
КонецФункции

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	//Забрали строку 
	Товар = Элементы.Товары.ТекущиеДанные;
	//Отправили элемент из колонки строки в функцию для обработки и забрали в текущую строку
	Товар.ЦенаПоступления =  ТоварыТоварПриИзмененииНаСервере(Товар.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Товар = Элементы.Товары.ТекущиеДанные;
	Товар.Стоимость = Товар.Количество * Товар.ЦенаПоступления;
КонецПроцедуры

