
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		Покупатель = ДанныеЗаполнения.Поставщик;
		Сумма = ДанныеЗаполнения.СуммаЗаказа;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// Заполнение шапки
		Покупатель = ДанныеЗаполнения.Покупатель;
		Сумма = ДанныеЗаполнения.СуммаЗаказа;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		Если Константы.НесколькоВалют.Получить() Тогда
		Если  Валюта.Ссылка = Справочники.Валюта.ПустаяСсылка()  Тогда
			  Валюта = Константы.ВалютаПоУмолчанию.Получить();
		  КонецЕсли;
	  Иначе
		  Валюта = Константы.ВалютаПоУмолчанию.Получить();
	КонецЕсли;
КонецПроцедуры

