&НаСервере
Процедура УдалитьЭлементыНаСервере()
	
	ЗапросГрупп = Новый Запрос;
	ЗапросГрупп.Текст = "ВЫБРАТЬ
	                    |	Номенклатура.Код
	                    |ИЗ
	                    |	Справочник.Номенклатура КАК Номенклатура
	                    |ГДЕ
	                    |	Номенклатура.ЭтоГруппа = ЛОЖЬ";
	
	ГруппыНоменклатуры  = ЗапросГрупп.Выполнить().Выгрузить();
	
	
		Для Каждого Элемент  Из ГруппыНоменклатуры Цикл
			ЭлементСправочника = Справочники.Номенклатура.НайтиПоКоду(Элемент.Код);
			Сообщить("Удаляем номенклатуру "+ЭлементСправочника.ПолучитьОбъект().Наименование);
			ЭлементСправочника.ПолучитьОбъект().Удалить();
		КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементы(Команда)
	УдалитьЭлементыНаСервере();
КонецПроцедуры
