
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		// Заполнение шапки
		Поставщик = ДанныеЗаполнения.Поставщик;
		Склад = ДанныеЗаполнения.Склад;
		Заказ = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Стоимость = ТекСтрокаТовары.Стоимость;
			НоваяСтрока.ЦенаПоступления = ТекСтрокаТовары.ЦенаПоступления;
			НоваяСтрока.Характеристика = ТекСтрокаТовары.Характеристика;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
		 
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныПоставщиков

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	Движения.ЦеныПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЦеныПоставщиков.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Поставщик = Поставщик;
		Движение.Цена = ТекСтрокаТовары.ЦенаПоступления;
	КонецЦикла;

	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуги Тогда
			 Продолжить;
		КонецЕсли;
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		
		Если Склад.Ссылка = Справочники.Склады.ПустаяСсылка() Тогда
			 Склад = Справочники.Склады.Оптовый; 
		КонецЕсли;
		Движение.Склады = Склад;
		
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	Движения.ОбъемыЗакупок.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Номенклатура.ВидНоменклатуры = Перечисления.ВидНоменклатуры.Услуги Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.ОбъемыЗакупок.Добавить();
		Движение.Период = Дата;
		
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		
		Движение.Стоимость = ТекСтрокаТовары.Стоимость;
		
		Если Склад.Ссылка = Справочники.Склады.ПустаяСсылка() Тогда
			 Склад = Справочники.Склады.Оптовый; 
		КонецЕсли;
		Движение.Склады = Склад;

		Движение.Количество = ТекСтрокаТовары.Количество;

	КонецЦикла;

	
КонецПроцедуры
