///////////////////////////////////////////////////////////////////////////
// ОБЩИЕ КОМАНДЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры); 
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ПередаваемыеНастройки = Новый Структура;
	ПередаваемыеНастройки.Вставить("АвтосохранениеПриЗакрытии", Объект.АвтосохранениеПриЗакрытии);
	ПередаваемыеНастройки.Вставить("НеВыводитьВременныеТаблицы", Объект.НеВыводитьВременныеТаблицы);
	ПередаваемыеНастройки.Вставить("ДобавлятьКолонкуУИДДляСсылочныхТипов", Объект.ДобавлятьКолонкуУИДДляСсылочныхТипов);
	ПередаваемыеНастройки.Вставить("ВосстанавливатьРезультатЗапросаПриАктивизации", Объект.ВосстанавливатьРезультатЗапросаПриАктивизации);
	
	// Передача в открывающую форму.
	Закрыть(ПередаваемыеНастройки); 

КонецПроцедуры
